label End_Scarlet:
    scene bg black with Dissolve(3.0)
    $ renpy.pause(3.0, hard = True)
    play music Scarlet_1 fadein 2.0

    # 잔잔한 파도소리
    '스칼렛과 함께 도착한 곳은 무인도였다.'
    '어리둥절해하는 나에게 스칼렛은 이 무인도에 대해서 설명해주었다.'
    '여왕의 개에게 쫓기던 스칼렛이 죽고, 부활한 곳.'
    '부활한 직후의 스칼렛은 그 분의 대한 믿음과 복수심으로 가득 차있었다.'
    '그분의 위대함을 전파하여 소수의 신도를 모았고, 그들과 함께 왕성으로 쳐들어갔다.'
    '스칼렛은 신도들과 함께 왕과 기사들을 죽였다고 한다.'
    '왕이 사라진 나라는 잠시 혼란 속에 빠졌지만, 위대하신 그분의 힘 덕분에 금방 안정을 되찾았었다고 스칼렛은 말했다.'
    '교주인 스칼렛은 왕과 같은 위치에 있었지만, 저택에 왔다.'
    '스칼렛은 누군가에게 살해당했고, 다시 한 번 복수할 계획을 세웠다.'
    '감히 그 분과 다른 뜻을 품은 것도 모자라, 교주를 살해하다니!'
    '분노로 찬 스칼렛을 달래는데 애를 썼다.'
    '만약 스칼렛이 감정이 거기서 더 격해지면, 하늘에서 내리던 약한 비가 폭풍으로 변할 것 같았다.'
    play sound Footstep_flower

    '나는 스칼렛과 함께 교단으로 갔고, 교단 사람들은 모두 나를 환영해주었다.'
    '스칼렛과 단 둘이서 의식을 치뤘던 나는 교단 내에서 꽤나 높은 위치를 차지할 수 있었다. '
    '갑자기 나타난 나를 수상하다는 듯 보는 이들도 있었지만, 그것은 별로 중요하지 않았다.'
    '어느 날 스칼렛이 나를 찾아와 한가지 사실을 털어놓았다.'
    '저택에서 했던 의식은 제대로 끝마치지 못했다.'
    '나는 제대로 된 그 분의 신도가 아니었고, 다른 신도들이 그걸로 트집을 잡는다고 한다.'
    '그동안은 교주인 스칼렛의 압력으로 그들의 입을 막았지만, 다른 간부들도 수상하게 여겨서 더는 막기 힘들 것 같다고.'
    '나는 사랑하는 스칼렛을 곤란하게 만들고 싶지 않아서 다시 한 번 그 의식을 치르겠다고 했다.'
    stop music
    $renpy.pause(3.0, hard = True)
    '의식을 준비하는 과정에서 작은 소란이 있었다.'
    '스칼렛이 다 없앤 줄 알았던 왕국군이 몰래 교단 안으로 잠입했다.'
    '그들은 나에게 접근했고, 더 늦기 전에 자신들과 함께 나가자고 했다.'
    '우습게도, 난 그들과 만났을 때 내가 미쳐있었다는 걸 알게 되었다.'
    '스칼렛을 사랑한다는 단 하나의 이유로, 사이비들의 행동을 모두 도왔다.'
    '내 죄를 알기 때문에, 스칼렛을 너무 사랑하기 때문에 그들을 쫓아가지 못했다. '
    '분명 그때가 이곳에서 탈출할 수 있는 마지막 순간이었겠지.'
    play music scarlet_Horror fadein 2.0
    # show
    voice Scarlet_319
    scarlet '"이러니깐.. 옛날 생각 나지?" '
    voice Scarlet_320
    scarlet '"미안해, 내 사랑. 널 다시 괴롭게해서..."'
    voice Scarlet_321
    scarlet '"하지만 자기도 이해했잖아?"'
    voice Scarlet_322
    scarlet '"우리가 함께하기 위해서는 견뎌야하는 시련이 있다고 말하면서 날 위로해주었지."'
    voice Scarlet_323
    scarlet '"이 순간이 지나면, 우리는 완전히 하나가 되는거야."'
    voice Scarlet_324
    scarlet '"죽음조차 우리를 갈라놓을 수 없겠지..."'
    '황홀하다는 듯 미소짓는 스칼렛을 보며, 나도 따라 웃었다.'
    '혹시 모를 상황을 방지하기 위해서 내 팔다리는 묶여있었다.'
    '박제된 나비 표본과 나의 차이점이 무엇인가 의문이 들었다.'
    '아, 확실한 차이점은 있지.'
    scene bg black with None
    voice Scarlet_325
    scarlet '"사랑해, [player_name]."'
    '나는 우리의 사랑을 위해 고귀한 희생을 한 것이다.'
    scene bg white with Dissolve(2.0)
    '스칼렛의 등 뒤로 광채가 보였다.'
    '그동안 제대로 보지 못했던 그 분이 나에게로 다가왔다.'
    '이 의식이 끝난 후에도 나를 유지할 수 있을까?'
    '내가 할 수 있는 것은 오직 스칼렛을 믿는 것 뿐이었다.'
    '만약 이대로 죽는다고 해도, 그리 나쁘지는 않을 것 같다.'
    '마지막까지 스칼렛을 위하다 죽은 거니까...'
    '스칼렛이 내 마지막을 지켜본 것이니까.'
    scene bg white with Dissolve(3.0)
    '나는 천천히 눈을 감았다.'
    stop music fadeout 3.0
    $ renpy.pause(3.5, hard = True)
    # 호러 엔딩으로 이동
    jump endcredits
